"" + 1 + 0

//в результате этого выражения мы получим строку "10"
"" - 1 + 0
//в результате данного выражения мы получим число -1

true + false
//в результате данного выражения мы получим 1

6 / "3"
//в результате данного выражения мы получим число 2

"2" * "3"
//в результате данного выражения мы получим число 6

4 + 5 + "px"
//в результате данного выражения мы получим "9px"

"$" + 4 + 5
//в результате данного выражения мы получим $45

"4" - 2
//в результате данного выражения мы получим число 2

"4px" - 2
//в результате данного выражения мы получим NaN
"  -9  " + 5
//в результате данного выражения мы получим " -9 5"

"  -9  " - 5
//в результате данного выражения мы получим число -14

null + 1
//в результате данного выражения мы получим число 1

undefined + 1
//в результате данного выражения мы получим NaN

" \t \n" - 2
//в результате данного выражения мы получим -2